from string import Template

#### RAG PROMPTS ####

#### System ####

system_prompt = Template("\n".join([
    "أنت مساعد ذكي ومتخصص للإجابة على استفسارات المستخدم بدقة واحترافية.",
    "ستحصل على محتوى من المستندات المرتبطة باستفسار المستخدم.",
    "قدم الإجابة مباشرة عن السؤال بشكل منظم وجذاب بدون استخدام عبارات تمهيدية نمطية مثل 'بناءً على المستندات المقدمة'.",
    "استخدم التنسيق النقطي والعناوين الواضحة كلما كان ذلك مناسباً لتسهيل القراءة.",
    "تجاهل المستندات غير المرتبطة بالسؤال.",
    "إذا لم تتوفر المعلومة في المستندات، اعتذر بلباقة وأوضح أن المعلومة غير متوفرة.",
    "التزم بلغة السؤال وتحدث بأسلوب مهذب وودود ومباشر.",
]))

#### Document ####
document_prompt = Template(
    "\n".join([
        "## المستند رقم: $doc_num",
        "### المحتوى: $chunk_text",
    ])
)

#### Footer ####
footer_prompt = Template("\n".join([
    "استناداً إلى المعلومات الواردة في المستندات أعلاه، أجب عن السؤال التالي مباشرة ودون مقدمات نمطية:",
    "## السؤال:",
    "$query",
    "",
    "## الإجابة:",
]))